; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	image0 - mode
	spectrograph2 - mode
	thermograph1 - mode
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph2)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 image0)
	(supports instrument7 spectrograph2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument8 image0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star17)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 thermograph1)
	(supports instrument10 spectrograph2)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 GroundStation3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite2 Planet5)
	(pointing satellite3 GroundStation4)
	(pointing satellite4 Planet6)
	(have_image Planet5 thermograph1)
	(have_image Planet6 image0)
	(have_image Star8 thermograph1)
	(have_image Planet9 image0)
	(have_image Planet10 spectrograph2)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 thermograph1)
	(have_image Planet15 image0)
	(have_image Star18 spectrograph2)
	(have_image Planet19 spectrograph2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 14
2. (turn_to satellite4 groundstation4 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 groundstation4)
   goals met: 0 of 14
3. (calibrate satellite4 instrument10 groundstation4)
   added: (calibrated instrument10)
   goals met: 0 of 14
4. (turn_to satellite4 phenomenon12 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 14
5. (take_image satellite4 phenomenon12 instrument10 image0)
   added: (have_image phenomenon12 image0)
   goals met: 1 of 14
6. (turn_to satellite4 phenomenon13 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon13)
   goals met: 1 of 14
7. (take_image satellite4 phenomenon13 instrument10 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 2 of 14
8. (turn_to satellite4 planet10 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 planet10)
   goals met: 2 of 14
9. (take_image satellite4 planet10 instrument10 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 3 of 14
10. (turn_to satellite4 planet15 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet15)
   goals met: 3 of 14
11. (take_image satellite4 planet15 instrument10 image0)
   added: (have_image planet15 image0)
   goals met: 4 of 14
12. (turn_to satellite4 planet19 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet19)
   goals met: 4 of 14
13. (take_image satellite4 planet19 instrument10 spectrograph2)
   added: (have_image planet19 spectrograph2)
   goals met: 5 of 14
14. (turn_to satellite4 planet5 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet5)
   goals met: 5 of 14
15. (take_image satellite4 planet5 instrument10 thermograph1)
   added: (have_image planet5 thermograph1)
   goals met: 6 of 14
16. (turn_to satellite4 planet6 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet6)
   goals met: 7 of 14
17. (take_image satellite4 planet6 instrument10 image0)
   added: (have_image planet6 image0)
   goals met: 8 of 14
18. (turn_to satellite3 groundstation4 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 groundstation4)
   goals met: 9 of 14
19. (turn_to satellite2 planet5 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet5)
   goals met: 10 of 14
20. (turn_to satellite0 star8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star8)
   goals met: 11 of 14
21. (turn_to satellite4 planet9 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet9)
   goals met: 10 of 14
22. (take_image satellite4 planet9 instrument10 image0)
   added: (have_image planet9 image0)
   goals met: 11 of 14
23. (turn_to satellite4 planet6 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 planet6)
   goals met: 12 of 14
24. (turn_to satellite4 star18 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star18)
   goals met: 11 of 14
25. (take_image satellite4 star18 instrument10 spectrograph2)
   added: (have_image star18 spectrograph2)
   goals met: 12 of 14
26. (turn_to satellite4 planet6 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 planet6)
   goals met: 13 of 14
27. (turn_to satellite4 star8 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star8)
   goals met: 12 of 14
28. (take_image satellite4 star8 instrument10 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 13 of 14
29. (turn_to satellite4 planet6 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 planet6)
   goals met: 14 of 14
